---
kind: property
id: P:Autodesk.Revit.DB.ColumnAttachment.CutStyle
source: html/dd6e984c-e922-b4a6-9c35-346b916dff84.htm
---
# Autodesk.Revit.DB.ColumnAttachment.CutStyle Property

Identifies whether the column, or the attached element should be cut (or if neither should be cut).

## Syntax (C#)
```csharp
public ColumnAttachmentCutStyle CutStyle { get; }
```